Masmiseim36/nxpSDK/boards/evkmimxrt1170/wifi_cypress_examples/wiced_iperf_4343W/cm4/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_31 (coord J17), WL_REG_ON */
/* Routed pin properties */
#define BOARD_INITPINS_WL_REG_ON_PERIPHERAL                                GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_WL_REG_ON_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WL_REG_ON_CHANNEL                                     30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WL_REG_ON_GPIO                                      GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WL_REG_ON_GPIO_PIN                                    30U   /*!< GPIO pin number */
#define BOARD_INITPINS_WL_REG_ON_GPIO_PIN_MASK                       (1U << 30U)   /*!< GPIO pin mask */

/* GPIO_AD_34 (coord J16), SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_VSELECT_PERIPHERAL                             GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_VSELECT_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SD1_VSELECT_CHANNEL                                    1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SD1_VSELECT_GPIO                                   GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SD1_VSELECT_GPIO_PIN                                   1U   /*!< GPIO pin number */
#define BOARD_INITPINS_SD1_VSELECT_GPIO_PIN_MASK                      (1U << 1U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
